In [10]:
import pandas as pd

#series de pandas

numeros = [3,4,5,6,7]
serie = pd.Series(numeros)
serie,type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [ ]:
data = {
 "Nombre":["Ana", "Alexis", "Juan"],
 "Edad":[22,21,33],
 "Ciudad":["España", "Cali", "Bogota"]
}
data, type(data)

({'Nombre': ['Ana', 'Alexis', 'Juan'],
  'Edad': [22, 21, 33],
  'Ciudad': ['España', 'Cali', 'Bogota']},
 dict)

In [ ]:
df = pd.DataFrame (data=data)
df

   Nombre  Edad  Ciudad
0     Ana    22  España
1  Alexis    21    Cali
2    Juan    33  Bogota

In [ ]:
df.to_csv("data.csv")

In [76]:
import_df = pd.read_csv("data.csv", index_col=0)
import_df

   Nombre  Edad  Ciudad
0     Ana    22  España
1  Alexis    21    Cali
2    Juan    33  Bogota

In [56]:
ciudades = df["Ciudad"]
print(ciudades, type(ciudades))

0    España
1      Cali
2    Bogota
Name: Ciudad, dtype: object <class 'pandas.core.series.Series'>

In [65]:
df[["Ciudad","Nombre"]]

   Ciudad  Nombre
0  España     Ana
1    Cali  Alexis
2  Bogota    Juan

In [ ]:
fila = df.loc[1]

fila

Nombre    Alexis
Edad          21
Ciudad      Cali
Name: 1, dtype: object

In [83]:
df[df["Edad"]>=22]

  Nombre  Edad  Ciudad
0    Ana    22  España
2   Juan    33  Bogota

In [ ]:
filtro = (df["Edad"]>=22) & (df["Nombre"].str.startswith("A"))
df[filtro]

  Nombre  Edad  Ciudad
0    Ana    22  España

In [91]:
# Filtrado por query
df.query("Edad>23")

  Nombre  Edad  Ciudad
2   Juan    33  Bogota

In [95]:
df[df["Nombre"].isin(["Ana","Juan"])]

  Nombre  Edad  Ciudad
0    Ana    22  España
2   Juan    33  Bogota

In [ ]:
def longitudThree(nombre):
    return len (nombre) == 3

df[df["Nombre"].apply(longitudThree)]

  Nombre  Edad  Ciudad
0    Ana    22  España

In [104]:
# Edades entre 23 y 33 años
df[df["Edad"].between(22,33)]

  Nombre  Edad  Ciudad
0    Ana    22  España
2   Juan    33  Bogota

In [107]:
df

   Nombre  Edad  Ciudad
0     Ana    22  España
1  Alexis    21    Cali
2    Juan    33  Bogota

In [82]:
print(pf.describe())
print("")
print(pf.dtypes)
print()

print(pf[pf["Edad"] >= 23])
print()

print(pf["Ciudad"])

            Edad
count   3.000000
mean   25.333333
std     6.658328
min    21.000000
25%    21.500000
50%    22.000000
75%    27.500000
max    33.000000

Nombre    object
Edad       int64
Ciudad    object
dtype: object

  Nombre  Edad  Ciudad
2   Juan    33  Bogota

0    España
1      Cali
2    Bogota
Name: Ciudad, dtype: object